W6D3/routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
---
  def index
    artworks = Artwork.where(artist_id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def update
    artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "artworks" SET "favorited" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorited", true], ["updated_at", "2020-01-23 22:37:23.450422"], ["id", 25]]
---
  def favorite
    artwork = Artwork.find(params[:id])

    status = (artwork.favorited ? false : true)
    artwork.update(favorited: status)