W6D3/routes_and_controllers/app/controllers/collections_controller.rb

  def show
    artworks = Artwork.joins(:collections).where("collections.title = '#{params[:id]}'")
---
SELECT "artworks".* FROM "artworks" INNER JOIN "collections" ON "collections"."artwork_id" = "artworks"."id" WHERE (collections.title = 'cat'')

  def index
    collections = Collection.where(user_id: params[:user_id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 41]]