W6D3/routes_and_controllers/app/controllers/likes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def index
    if params.has_key?(:user_id)
      user = User.find_by(id: params[:user_id])
      render json: (user.liked_comments + user.liked_artworks)
    elsif params.has_key?(:artwork_id)
      artwork = Artwork.find_by(id: params[:artwork_id])
      render json: artwork.likers
    elsif params.has_key?(:comment_id)
      comment = Comment.find_by(id: params[:comment_id])