W6D3/routes_and_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "james"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    users = User.where("username LIKE '%#{params[:username]}%'")
    all_users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
  def destroy
    user = User.find(params[:id])
    if user.delete