W6D5/cats/app/views/cats/show.html.erb

        </tr>
        <% @cat.cat_rental_requests.each do |request| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 9]]