W6D5/cats/app/models/cat_rental_request.rb

    def approve!
        self.update(status: "APPROVED")
        opr = overlapping_pending_requests.each do |request|
            request.update(status:'DENIED')
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-01-26 23:53:18.749856"], ["id", 5]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-01-26 23:53:52.773535"], ["id", 1]]