W6D5/cats/app/controllers/cat_rental_requests_controller.rb

    def new
        @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def create

        @cat_rental_request = CatRentalRequest.new(request_params)
        if @cat_rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 17], ["start_date", "2020-01-25"], ["end_date", "2020-01-30"], ["created_at", "2020-01-26 22:38:04.577816"], ["updated_at", "2020-01-26 22:38:04.577816"]]

    def deny
        cat_rental_request = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def approve
        cat_rental_request = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]