W6D5/cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    #debugger
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "real"], ["color", "Black"], ["description", ""], ["updated_at", "2020-01-25 00:54:57.196675"], ["id", 7]]